# TextureRealWorldOffsetX Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Speckle..::..TextureRealWorldOffsetX Property
Speckle Class See Also
---
The property labeled "Offset X" from the "Speckle" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string TextureRealWorldOffsetX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TextureRealWorldOffsetX As String
	Get
```

Visual C++
---
```text
public:
static property String^ TextureRealWorldOffsetX {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDistance".
# See Also
Speckle Class
Autodesk.Revit.DB.Visual Namespace